src/cf/src/Catalogs/РабочиеМеста/РабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМеста</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойШаблонУдаленногоДоступа</name>
    <type>
      <types>CatalogRef.ШаблоныУдаленногоДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРабочихИнструментов</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/CommonModules/УдаленноеУправлениеВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ШаблонУдаленногоПодключенияПоУмолчанию() Экспорт	 
	
	Возврат "";  // не задано
	
КонецФункции

// Основной шаблон удаленного доступа
//
// Параметры:
//  РабочееМесто - СправочникСсылка.РабочиеМеста
// 
// Возвращаемое значение:
//   СправочникСсылка.ШаблоныУдаленногоДоступа
//
Функция ОсновнойШаблонУдаленногоДоступа(РабочееМесто) Экспорт 	 
	Возврат РабочееМесто.ОсновнойШаблонУдаленногоДоступа;	 
КонецФункции

// Шаблон подключения рабочий каталог
//
// Параметры:
//  ШаблонПодключения	 - СправочникСсылка.ШаблоныУдаленногоДоступа 
// 
// Возвращаемое значение:
//  Строка 
//
Функция ШаблонПодключенияРабочийКаталог(ШаблонПодключения) Экспорт 	 
	Возврат ШаблонПодключения.РабочийКаталог;
КонецФункции

// Текст командной строки
//
// Параметры:
//  РабочееМесто - СправочникСсылка.РабочиеМеста
//  ШаблонПодключения - СправочникСсылка.ШаблоныУдаленногоДоступа 
// 
// Возвращаемое значение:
//  Строка 
//
Функция ПолучитьТекстКоманднойСтроки(РабочееМесто, ШаблонПодключения) Экспорт 
	
	СтрокаКоманды = ШаблонПодключения.ШаблонКоманднойСтроки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеМестаДополнительныеРеквизиты.Ссылка КАК Объект,
	|	РабочиеМестаДополнительныеРеквизиты.Свойство КАК Свойство,
	|	РабочиеМестаДополнительныеРеквизиты.Значение КАК Значение
	|ИЗ
	|	Справочник.РабочиеМеста.ДополнительныеРеквизиты КАК РабочиеМестаДополнительныеРеквизиты
	|ГДЕ
	|	РабочиеМестаДополнительныеРеквизиты.Ссылка = &Объект"; 
	
	Запрос.УстановитьПараметр("Объект", РабочееМесто);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Свойство = "%"+ВыборкаДетальныеЗаписи.Свойство+"%";
		СтрокаКоманды = СтрЗаменить(СтрокаКоманды,Свойство, ВыборкаДетальныеЗаписи.Значение); 	
		
	КонецЦикла;
	
	Возврат СтрокаКоманды;	 
	
КонецФункции 

#КонецОбласти
